# Теория игр. ВШЭ

[Ссылка на курс](https://www.coursera.org/learn/game-theory)

Отличный курс, в котором профессор ВШЭ Дагаев подробно и понятно рассказывает основные понятия теории игр.
И разбирает на задачи. Задачи вполне себе из жизни.
Особенно запомнились алгоритмы матчинга для свадьб или для соседей в общаге (толерантное название, вы понимаете, да?).
А также задача про ястребов и голубей.

Кстати, Дагаев в целом занимается интересными вещами, а именно, приложением математики к спорту.
Например, в 2019 году его кафедра составляла расписание игр для РФПЛ.
